{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\ldepedro\OneDrive - Syracuse University\AAA JUNIOR year\ECN 310\course-project-tariffs\Do files\TariffsTimeserieslog.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Dec 2025, 16:56:55

{com}. do "C:\Users\ldepedro\AppData\Local\Temp\STD9c7c_000001.tmp"
{txt}
{com}. *Do file to merge our raw data, and explore it
. * Install outreg2 
. ssc install outreg2
{txt}checking {hilite:outreg2} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. *First run this to change directory, where all of the raw data is
. cd "C:\Users\ldepedro\OneDrive - Syracuse University\AAA JUNIOR year\ECN 310\course-project-tariffs\Data files"  
{res}C:\Users\ldepedro\OneDrive - Syracuse University\AAA JUNIOR year\ECN 310\course-project-tariffs\Data files
{txt}
{com}. 
. *run this command to import the first excel data to stata
. import excel "TariffPTaxRev.xlsx", sheet("Country-Timeseries") firstrow clear
{res}{text}(37 vars, 193 obs)

{com}. *to save the first data excel file as a dta
. save "TariffsTimeseries1.dta",replace
{txt}{p 0 4 2}
file {bf}
TariffsTimeseries1.dta{rm}
saved
{p_end}

{com}. clear
{txt}
{com}. 
. *import excel file 2
. import excel "ExportPGDP.xlsx", sheet("Country-Timeseries") firstrow clear
{res}{text}(37 vars, 193 obs)

{com}. save "TariffsTimeseries2.dta",replace
{txt}{p 0 4 2}
file {bf}
TariffsTimeseries2.dta{rm}
saved
{p_end}

{com}. clear
{txt}
{com}. 
. *import excel file 3
. import excel "ImportPGDP.xlsx", sheet("Country-Timeseries") firstrow clear
{res}{text}(37 vars, 193 obs)

{com}. *save as dta
. save "TariffsTimeseries3.dta",replace
{txt}{p 0 4 2}
file {bf}
TariffsTimeseries3.dta{rm}
saved
{p_end}

{com}. clear
{txt}
{com}. 
. *import excel file 4
. import excel "ImportValue.xlsx", sheet("Country-Timeseries") firstrow clear
{res}{text}(37 vars, 193 obs)

{com}. *save as dta
. save "TariffsTimeseries4.dta",replace
{txt}{p 0 4 2}
file {bf}
TariffsTimeseries4.dta{rm}
saved
{p_end}

{com}. clear
{txt}
{com}. 
. *import excel file 5
. import excel "DomesticTaxRev.xlsx", sheet("Country-Timeseries") firstrow clear
{res}{text}(37 vars, 193 obs)

{com}. *save as dta
. save "TariffsTimeseries5.dta",replace
{txt}{p 0 4 2}
file {bf}
TariffsTimeseries5.dta{rm}
saved
{p_end}

{com}. clear
{txt}
{com}. 
. *import excel file 6
. import excel "InternationalTaxRev.xlsx", sheet("Country-Timeseries") firstrow clear
{res}{text}(37 vars, 193 obs)

{com}. *save as dta
. save "TariffsTimeseries6.dta",replace
{txt}{p 0 4 2}
file {bf}
TariffsTimeseries6.dta{rm}
saved
{p_end}

{com}. clear
{txt}
{com}. *import excel file 7
. import excel "GDP(Current USD).xlsx" , sheet("Country-Timeseries") firstrow clear
{res}{text}(37 vars, 190 obs)

{com}. *save as dta 
. save "TariffsTimeseries7.dta",replace
{txt}{p 0 4 2}
file {bf}
TariffsTimeseries7.dta{rm}
saved
{p_end}

{com}. 
. *we just finished saving the files as dta so now we can begin merging them
. *now we use the one of the dta files we just created
. use "TariffsTimeseries1.dta"
{txt}
{com}. append using "TariffsTimeseries2.dta"
{txt}{p 0 7 2}
(variable
{bf:AK} was {bf:byte}, now {bf:double} to accommodate using data's values)
{p_end}

{com}. append using "TariffsTimeseries3.dta"
{txt}
{com}. append using "TariffsTimeseries4.dta"
{txt}
{com}. append using "TariffsTimeseries5.dta"
{txt}
{com}. append using "TariffsTimeseries6.dta"
{txt}
{com}. append using "TariffsTimeseries7.dta"
{txt}
{com}. 
. *we just finished merging all the excel files into the same dta file.
. save "TariffsTimeseries.dta", replace
{txt}{p 0 4 2}
file {bf}
TariffsTimeseries.dta{rm}
saved
{p_end}

{com}. 
. *now use the file we just created
. *Removing the years not included in 2001-2020
. drop C
{txt}
{com}. drop D
{txt}
{com}. drop E
{txt}
{com}. drop F
{txt}
{com}. drop G
{txt}
{com}. drop H
{txt}
{com}. drop I
{txt}
{com}. drop J
{txt}
{com}. drop K
{txt}
{com}. drop L
{txt}
{com}. drop M
{txt}
{com}. drop N
{txt}
{com}. drop O
{txt}
{com}. drop AJ
{txt}
{com}. drop AK
{txt}
{com}. 
. *get rid of the countries we dont need 
. keep if CountryName == "United States" | CountryName == "Australia" | CountryName == "France" | CountryName == "Israel" | CountryName == "Korea, Rep." | CountryName == "Norway" | CountryName == "Switzerland" | CountryName =="Ireland" | CountryName == "Canada" | CountryName == "New Zealand" | CountryName == "Belgium"
{txt}(1,271 observations deleted)

{com}. 
. * Remaning letter variables to years (yr)
. rename P yr01
{res}{txt}
{com}. rename Q yr02
{res}{txt}
{com}. rename R yr03
{res}{txt}
{com}. rename S yr04
{res}{txt}
{com}. rename T yr05
{res}{txt}
{com}. rename U yr06
{res}{txt}
{com}. rename V yr07
{res}{txt}
{com}. rename W yr08
{res}{txt}
{com}. rename X yr09
{res}{txt}
{com}. rename Y yr010
{res}{txt}
{com}. rename Z yr011
{res}{txt}
{com}. rename AA yr012
{res}{txt}
{com}. rename AB yr013
{res}{txt}
{com}. rename AC yr014
{res}{txt}
{com}. rename AD yr015
{res}{txt}
{com}. rename AE yr016
{res}{txt}
{com}. rename AF yr017
{res}{txt}
{com}. rename AG yr018
{res}{txt}
{com}. rename AH yr019
{res}{txt}
{com}. rename AI yr020
{res}{txt}
{com}. 
. *transforming "year" into a singular variable observing the years 2001-2020
. reshape long yr0, i(CountryName IndicatorName) j(year)
{txt}(j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}          77   {txt}->   {res}1,540       
{txt}Number of variables        {res}          22   {txt}->   {res}4           
{txt}j variable (20 values)                    ->   {res}year
{txt}xij variables:
                    {res}yr01 yr02 ... yr020   {txt}->   {res}yr0
{txt}{hline 77}

{com}. rename yr0 value
{res}{txt}
{com}. replace year = year + 2000
{txt}variable {bf}{res}year{sf}{txt} was {bf}{res}byte{sf}{txt} now {bf}{res}int{sf}
{txt}(1,540 real changes made)

{com}. 
. *reshaping individual indicators as variables 
. encode IndicatorName, gen(IndicatorID)
{txt}
{com}. drop IndicatorName
{txt}
{com}. reshape wide value, i(year CountryName) j(IndicatorID)
{txt}(j = 1 2 3 4 5 6 7)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}       1,540   {txt}->   {res}220         
{txt}Number of variables        {res}           4   {txt}->   {res}9           
{txt}j variable (7 values)       {res}IndicatorID   {txt}->   (dropped)
xij variables:
                                  {res}value   {txt}->   {res}value1 value2 ... value7
{txt}{hline 77}

{com}. 
. *renaming value variables
. rename value1 TariffPTaxRev
{res}{txt}
{com}. rename value2 ExportPGDP
{res}{txt}
{com}. rename value3 GDPCurrent
{res}{txt}
{com}. rename value4 ImportPGDP
{res}{txt}
{com}. rename value5 ImportValue
{res}{txt}
{com}. rename value6 DomesticTaxRev
{res}{txt}
{com}. rename value7 InternationalTaxRev
{res}{txt}
{com}. 
. *save new changes (needed for merging)
. save "TariffTimeseries_new.dta", replace 
{txt}{p 0 4 2}
file {bf}
TariffTimeseries_new.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\ldepedro\OneDrive - Syracuse University\AAA JUNIOR year\ECN 310\course-project-tariffs\Do files\TariffsTimeserieslog.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Dec 2025, 16:57:14
{txt}{.-}
{smcl}
{txt}{sf}{ul off}